domains/wheelcase/pe/hpc1_velo_changed/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


all_deformed.stl
{
    // How to obtain raw features (extractFromFile || extractFromSurface)
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0  : selects no edges
        // - 180: selects all edges
        includedAngle   150;
    }

    subsetFeatures
    {
        // Keep nonManifold edges (edges with >2 connected faces)
        nonManifoldEdges       no;

        // Keep open edges (edges with 1 connected face)
        openEdges       yes;
    }


    // Write options

        // Write features to obj format for postprocessing
        writeObj                yes;
}

//top_turned.stl
//{
//    // How to obtain raw features (extractFromFile || extractFromSurface)
//    extractionMethod    extractFromSurface;
//
//    extractFromSurfaceCoeffs
//    {
//        // Mark edges whose adjacent surface normals are at an angle less
//        // than includedAngle as features
//        // - 0  : selects no edges
//        // - 180: selects all edges
//        includedAngle   150;
//    }
//
//    subsetFeatures
//    {
//        // Keep nonManifold edges (edges with >2 connected faces)
//        nonManifoldEdges       no;
//
//        // Keep open edges (edges with 1 connected face)
//        openEdges       yes;
//    }


//    // Write options

//        // Write features to obj format for postprocessing
//        writeObj                yes;
//}

//velo_turned.stl
//{
//    // How to obtain raw features (extractFromFile || extractFromSurface)
//   extractionMethod    extractFromSurface;

//    extractFromSurfaceCoeffs
//    {
//        // Mark edges whose adjacent surface normals are at an angle less
//        // than includedAngle as features
//        // - 0  : selects no edges
//        // - 180: selects all edges
//        includedAngle   150;
//    }

//    subsetFeatures
//    {
//        // Keep nonManifold edges (edges with >2 connected faces)
//        nonManifoldEdges       no;

//        // Keep open edges (edges with 1 connected face)
//        openEdges       yes;
//    }


//    // Write options

//        // Write features to obj format for postprocessing
//        writeObj                yes;
//}

// ************************************************************************* //
